# ##-----------------------HW3_task1
# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
#~~~~~~~~~~~~~~~~~~~~~

# s=0
# list = list(map(int, input("Введите числа через пробел:\n").split()))
# for i in range(len(list)):
#     if i%2 != 0:
#          s+= list[i]
# print("Сумма равна:",s)
#~~~~~~~~~~~~~~~~~~~~~

# ##-----------------------HW3_task2
# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
#~~~~~~~~~~~~~~~~~~~~~

# a=0
# mult_list=[]
# list = list(map(int, input("Введите числа через пробел:\n").split()))
# print(list)
# l=len(list)//2 + 1 if len(list) % 2 != 0 else len(list)//2
# mult_list = [list[i]*list[len(list)-i-1] for i in range(l)]
# print(mult_list)
#~~~~~~~~~~~~~~~~~~~~~

# ##-----------------------HW3_task3
# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19
#~~~~~~~~~~~~~~~~~~~~~


# lst = [1.1, 1.2, 3.1, 5, 10.01]
# new_lst = [round(i % 1, 2) for i in lst if i % 1 != 0]
# print(max(new_lst) - min(new_lst))

list=[1.1, 1.2, 3.1, 5, 10.01]
new_list=[]
for i in list:
    if i%1!=0:
        new_list.append([round(i%1,2)])
print('max=',max(new_list))
print('min=',min(new_list))
min=min(new_list)
max=max(new_list)
print(type(min))